[
  {
    "id": "As400",
    "image": "../src/assets/services/As400.jpg",
    "title": "As/400 Apps",
    "overview": "AS/400 (Application System/400) is a mid-range computer system developed by IBM, released in 1988. It's known for its reliability, security, and ease of use.",
    "Key_features": "Integrated hardware and software & Object-based architecture & Menu-driven interface & Support for multiple programming languages (RPG, COBOL, C) & Robust database management (DB2)",
    "Applications": "ERP (Enterprise Resource Planning),CRM (Customer Relationship Management),Accounting and finance,Manufacturing and logistics,Retail and point-of-sale"
  },
  {
    "id": "Coldfusion",
    "image": "../src/assets/services/CFML.JPG",
    "title": "Cold Fusion, CFML",
    "overview": "ColdFusion CFML (ColdFusion Markup Language) is a scripting language used for developing web applications, particularly with Adobe ColdFusion.",
    "Key_features": "Rapid web application development & Script-based language (CFML) & Object-oriented programming (OOP) support & Integration with databases (relational and NoSQL) & Robust security features & Support for web servicess (SOAP, REST) & Built-in ORM (Object-Relational Mapping)"
  },
  {
    "id": "Datascience",
    "image": "../src/assets/services/DS.jpg",
    "title": "Data Science",
    "overview": "Data science is an interdisciplinary field that combines aspects of computer science, statistics, and domain-specific knowledge to extract insights and knowledge from data.",
    "Key_features": "Data collection and preprocessing & Data visualization and exploration & Statistical modeling and machine learning & Data mining and pattern discovery & Communication and presentation of results"
  },
  {
    "id": "AI",
    "image": "../src/assets/services/AI.jpg",
    "title": "Artificial intelligence",
    "overview": "AI (Artificial Intelligence) refers to the simulation of human intelligence in machines that are programmed to think like humans and mimic their actions.",
    "Key_features": " AI systems can analyze complex data, identify patterns, and make decisions or recommendations based on that analysis. & AI systems can operate independently, making decisions and taking actions without human intervention, enabling applications like autonomous vehicles, drones, and robots."
  },
  {
    "id": "ML",
    "image": "../src/assets/services/ML.jpg",
    "title": "Machine Learning",
    "overview": "Machine Learning (ML) is a subset of Artificial Intelligence (AI) that involves training algorithms to learn from data and make predictions or decisions without being explicitly programmed.",
    "Key_features": "Machine learning helps computers learn from data instead of being manually programmed. & It automates tasks like identifying patterns and making decisions.& It can handle large amounts of data efficiently.& ML models get better as they learn from more data.& It’s used in many areas like healthcare, finance, and online servicess."
  },
  {
    "id": "DL",
    "image": "../src/assets/services/DL.jpg",
    "title": "Deep Learning",
    "overview": "Deep  Learning is a subset of Machine Learning that involves the use of artificial neural networks to analyze and interpret data.",
    "Key_features": "Neural Networks & Deep Neural Networks & Convolutional Neural Networks (CNNs) & Recurrent Neural Networks (RNNs) & Long Short-Term Memory (LSTM) Networks & Autoencoders & Generative Adversarial Networks (GANs)"
  },
  {
    "id": "NLP",
    "image": "../src/assets/services/NLP.jpg",
    "title": "NLP                    (Natural Language Processing)",
    "overview": "NLP is a subfield of Artificial Intelligence (AI) that deals with the interaction between computers and humans in natural language.",
    "Key_features": "Text Preprocessing & Tokenization & Stemming and Lemmatization & Part-of-Speech (POS) Tagging & Named Entity Recognition (NER) & Sentiment Analysis & Machine Translation"
  },
  {
    "id": "Python",
    "image": "../src/assets/services/python.jpg",
    "title": "Python",
    "overview": "Python is a high-level, interpreted programming language that is widely used for various purposes such as web development, scientific computing, data analysis, artificial intelligence, and more.",
    "Key_features": "Easy to learn and use & High-level language & Interpreted language & Object-oriented programming & Large standard library & Dynamic typing & Cross-platform compatibility"
  },

  {
    "id": "Marketing",
    "image": "../src/assets/services/Marketing.jpg",
    "title": "Digital N Social Media Marketing",
    "overview": "Digital marketing encompasses a broad range of online marketing activities beyond social media, including websites, email, SEO, PPC and more."
  },
  {
    "id": "Oracle",
    "image": "../src/assets/services/oracle.jpg",
    "title": "Oracle Apps All Modules",
    "overview": "It is one of the most popular relational database engines in the IT market for storing, organizing, and retrieving data.Oracle database was the first DB that designed for enterprise grid computing and data warehousing."
  },
  {
    "id": "SAP",
    "image": "../src/assets/services/SAP.jpg",
    "title": "SAP All Modules",
    "overview": "SAP modules are business management software used to collect, store, manage, and interpret data from many functional areas. These modules are individual software components that address specific business functions or processes."
  },
  {
    "id": "Fullstack",
    "image": "../src/assets/services/Fullstack.jpg",
    "title": "Fullstack Java, JS, Hibernate, JSP",
    "overview": "Java is used to code a wide range of applications, including mobile apps, enterprise software, big data applications, and server-side technologies"
  },
  {
    "id": "Golang",
    "image": "../src/assets/services/Golang.jpg",
    "title": "Golang",
    "overview": "Golang is a procedural and statically typed programming language having the syntax similar to C programming language. Sometimes it is termed as Go Programming Language. "
  },
  {
    "id": "Mainframe",
    "image": "../src/assets/services/mainframe.jpg",
    "title": "Mainframe Apps Enhancement",
    "overview": "Mainframe computers and their services are critical for governments and large organizations owing to their capability of processing bulk data more efficiently as well as data security features."
  },
  {
    "id": "MEAN",
    "image": "../src/assets/services/MEAN.jpg",
    "title": "MEAN Stack",
    "overview": "The MEAN stack is a JavaScript-based framework for developing scalable web applications. The term MEAN is an acronym for MongoDB, Express, Angular, and Node — the four key technologies that make up the layers of the technology stack"
  },
  {
    "id": "MERN",
    "image": "../src/assets/services/MERN.jpg",
    "title": "MERN Stack",
    "overview": "The MERN stack is an open source–centric collection of technologies that uses JavaScript for both the browser and server sides of a web application. MERN is an acronym for the four technologies that form the stack: MongoDB, Express, React, and Node. js."
  },
  {
    "id": "MEVN",
    "image": "../src/assets/services/MEVN.jpg",
    "title": "MEVN Stack",
    "overview": "MEVN Stack is a JavaScript technology stack that contains four separate programs for building website and mobile applications. The MEVN Stack comprises MongoDB, Express. js, VueJS, and Node. js."
  },
  {
    "id": "2D",
    "image": "../src/assets/services/2D.jpg",
    "title": "Robotics 2D",
    "overview": "Robotics is a field that combines engineering, science, and technology to create machines that can perform tasks in place of or in addition to humans."
  },
  {
    "id": "RPA",
    "image": "../src/assets/services/RPA.jpg",
    "title": "Robotics Process Automation",
    "overview": "Robotic Process Automation (RPA) is a software technology that uses software robots to automate repetitive tasks that humans typically perform."
  },
  {
    "id": "Sales",
    "image": "../src/assets/services/sales.jpg",
    "title": "Salesforce, CRM",
    "overview": "Salesforce is a cloud-based customer relationship management (CRM) software that helps companies build customer relationships and improve productivity."
  },
  {
    "id": "Studio",
    "image": "../src/assets/services/apps.jpg",
    "title": "Statical Apps, R Studio",
    "overview": "R Studio provides a user-friendly interface that organizes windows, and includes features like code completion, syntax highlighting, and graph and table previews. RStudio also integrates with other software tools, such as Git for version control and Quarto for document authoring"
  },
  {
    "id": "Web",
    "image": "../src/assets/services/web.jpg",
    "title": "Web Apps, All Kind",
    "overview": "A web app, or web application, is software that runs in a web browser and allows users to interact with a remote server. Web apps are designed to be interactive, allowing users to: Log in to an account, Make payments, and Send and consume data. "
  }
]
